def add(a , b):
	print("Anwser is : " ,a + b)
	
def subtract(a , b):
	print("Anwser is : ",a - b)
	
def multiply(a , b):
	print("Anwser is : ",a * b)
	
def divide(a , b):
	print("Anwser is : ",a / b)
	
def main():
	print(" ")
	x = int(input("\033[1;33m [<>] \033[1;36m Enter Your Choice: "))
	print(" ")
	a = float(input("\033[1;33m [<>] \033[1;36m Enter Your Fisrt Number: "))
	print(" ")
	b = float(input("\033[1;33m [<>] \033[1;36m Enter Your Second Number: "))
	print(" ")
	
	if x == 1:
		add(a,b)
	elif x == 2:
		subtract(a,b)
	elif x == 3:
		multiply(a,b)
	elif x == 4:
		divide(a,b)
	else:
		print('\033[1;31m error')



print(" \033[1;31m███████╗██╗░░░██╗██╗███╗░░██╗")
print(" \033[1;32m██╔════╝██║░░░██║██║████╗░██║")
print(" \033[1;33m█████╗░░╚██╗░██╔╝██║██╔██╗██║")
print(" \033[1;34m██╔══╝░░░╚████╔╝░██║██║╚████║")
print(" \033[1;35m███████╗░░╚██╔╝░░██║██║░╚███║")
print(" \033[1;36m╚══════╝░░░╚═╝░░░╚═╝╚═╝░░╚══╝")
print(" ")
print("\033[1;31m░█████╗░░█████╗░██╗░░░░░░█████╗░")
print("\033[1;32m██╔══██╗██╔══██╗██║░░░░░██╔══██╗")
print("\033[1;33m██║░░╚═╝███████║██║░░░░░██║░░╚═╝")
print("\033[1;34m██║░░██╗██╔══██║██║░░░░░██║░░██╗")
print("\033[1;35m █████╔╝██║░░██║███████╗╚█████╔╝")
print("\033[1;36m ╚════╝░╚═╝░░╚═╝╚══════╝░╚════╝░")
print(" ")
print("\033[1;35m         Tool By : 𝗞. 𝗞𝗔𝗩𝗜𝗡𝗗𝗨 𝗕𝗔𝗦𝗛𝗜𝗧𝗛𝗔 @Evin_Boy")
print("\033[1;35m          𝗔𝗟𝗣𝗛𝗔 𝗖𝗢𝗡𝗙𝗜𝗚𝗨𝗘𝗦 𝗢𝗪𝗡𝗘𝗥 ")
print(" ")
print("\033[1;32m[1] \033[1;36m Add")
print("\033[1;32m[2] \033[1;36m Subtract")
print("\033[1;32m[3] \033[1;36m Multiply")
print("\033[1;32m[4] \033[1;36m Divide")
print(" ")

main()


	

	
		
	
	
	
   
